{"classes":["PERSON","LOCATION","SKILLS","CONTACT","EMAIL","ROLE","ORGANISATION","DURATION","CERTIFICATE","PROJECTS","EDUCATION","INSTITUTION"],"annotations":[["Sudheesh P\r\nCherthala, Kerala\r\n-Email me on Indeed: http://www.indeed.com/r/Sudheesh-P/8c59f9d5b1e01df6\r\n\r\n➢ To work in Competitive and Challenging environment and hence to prove my credibility in field of\r\nfinance, where I can apply my analytical and technical skill to attain an optimum perfection for the\r\ndevelopment of my career and company.\r\n\r\nWork Experience\r\n\r\nManager-Marketing\r\nMercury Academic Centre\r\nJanuary 2018 to January 2020\r\n\r\n• Design and implement a strategic business plan that expands company's customer base and ensure\r\nit's strong presence.\r\n• Own recruiting, objectives setting, coaching and performance monitoring of sales representatives\r\n• Developing and building a lead generation plan, meeting or exceeding monthly or annual target\r\n• Participating fully in training sessions, meetings, skill building and professional development classes.\r\n• Maintaining and expanding the database of prospects of the organization.\r\n• Outbound and inbound account management and sales.\r\n• Attending sales group meetings concerning sales targets or forecasts, reporting on market situation.\r\n• Collating and consolidating report on monthly sales performance per sales personnel.\r\n• Manage Team-Sales, Monitoring and Conduct sales and review meeting.\r\n\r\nAssistant Manager-Marketing & Operations\r\nMRF Limited\r\nAugust 2009 to April 2017\r\n\r\n• Manage and direct marketing team to achieve business targets.\r\n• Assist in developing or updating standard operating procedures for all business marketing activities.\r\n• Build strong relationship by addressing customer issues and complaints in a timely manner.\r\n• Provide marketing support and guidance to staff.\r\n• Monitor and control expense according to allotted budget.\r\n• Assist in interviewing, recruiting and training candidates.\r\n• Manage work assignment and allocation for staff.\r\n• Conduct performance review and provide performance feedback to staff.\r\n• Maintain accurate and clear documentation for operational procedures and activities.\r\n• Work in compliance with company policies and procedures.\r\n• Conduct regular meetings with team to discuss about issues, concerns, updates etc\r\n• Providing administration support to Sales Reps, Property Managers and Senior Management\r\n• Answering incoming calls; taking messages and re-directing calls as required.\r\n• Diary management and arranging appointments, booking meeting rooms and conference facilities.\r\n• Data entry (sales figures, property listings etc.)\r\n• Organising travel and accommodation for staff and customers.\r\n• Arranging both internal and external events.\r\n• Preparing strategic monthly marketing calendars.\r\n\r\n\f• Conducting marketing activities for sales lead generation.\r\n• Creating new leads and converting them to customers.\r\n•  Ensuring  effective  and  timely  deployment  of  POS/  POP  materials  to  the  target  markets  to  help\r\norganization achieve its goals.\r\n• Assigning targets to the sales team.\r\n• Increasing organization's market visibility and market share by branding its image.\r\n• Creating new leads and converting them to customers.\r\n\r\nAssistant Manager -Marketing\r\nIdeal Finance Service\r\nJanuary 2008 to January 2008\r\n\r\n09 Aug)\r\n\r\n• Managing Marketing Campaigns\r\n• Creating Awareness of Products Among Staff\r\n• Promoting Products of Bank\r\n• Preparing Materials for Marketing of Products\r\n• Coordinating with Ad Agency\r\n• Develop and enforce sound policies and structures for the growth of the company\r\n• Monitor daily operations to ensure a free flow process\r\n• Delegate tasks to members of the operations team.\r\n•  Oversee  the  processing  of  centralized  loans  and  other  banking  activities  to  ensure  due  process,\r\naccuracy and accountability are followed\r\n\r\nSamsung Electronics at Cochin - Kochi, Kerala\r\nJanuary 2007 to December 2007\r\n\r\n• Providing the relevant in service to the customers.\r\n• Managing Store Service Executives for higher service productivity for the Customer\r\n• Allocating Field Service Executives for timely finishing customer issues.\r\n• Coordinate and solve all the issues which is related to customer and firm.\r\n\r\nAssistant Marketing Manager\r\nAir Tel Communication at Cherthala - Cherthala, Kerala\r\nMay 2005 to December 2006\r\n\r\n• Guide the customers about the plans by understanding their need.\r\n• Giving the information to visiting customers regarding the Plans\r\n• Coordinating with the Managers and sales executives regarding the Sales targets.\r\n• Conducting Weekly and Monthly meeting for planning new sales lead activities\r\n• Closing the Sales call.\r\n• Achieving the monthly targets.\r\n\r\nEducation\r\n\r\nB COM in Commerce\r\nUniversity of Kerala\r\n\r\n\fSkills / IT Skills\r\n\r\n• Innovative.\r\n\r\n• Positive Attitude.\r\n\r\n• Effective Inter-personal skills.\r\n\r\n• Good in building & maintaining relationships.\r\n\r\n• Problem solving ability.\r\n\r\n• Strong counseling & convincing techniques.\r\n\r\n• Channel service & sales development\r\n\r\n• Team player\r\n\r\n• Quest for challenging work.\r\n\r\n• Hard Working.\r\n\r\n• Proactive.\r\n\r\n• Sincerity.\r\n\r\n\f",{"entities":[[0,10,"PERSON"],[12,29,"LOCATION"],[369,386,"ROLE"],[388,411,"ORGANISATION"],[413,441,"DURATION"],[1266,1306,"ROLE"],[1308,1319,"ORGANISATION"],[1321,1346,"DURATION"],[3085,3113,"ROLE"],[3115,3136,"ORGANISATION"],[3154,3176,"DURATION"],[4098,4125,"ROLE"],[4127,4148,"ORGANISATION"],[4183,4208,"DURATION"],[4588,4605,"EDUCATION"],[4607,4627,"INSTITUTION"]]}]]}