{"classes":["PERSON","LOCATION","SKILLS","CONTACT","EMAIL","ROLE","ORGANISATION","DURATION","CERTIFICATE","PROJECTS","EDUCATION","INSTITUTION"],"annotations":[["Sunitha Yerranagu\r\nBengaluru, Karnataka\r\n-Email me on Indeed: http://www.indeed.com/r/Sunitha-Yerranagu/6e2802eef14581ff\r\n\r\n• Expertise in creating responsive websites using HTML5, CSS3, React Js and JAVASCRIPT \r\n• Making pixel perfect Websites from scratch \r\n• Good Expertise in analyzing the Document Object Model (DOM) Layout, DOM functions and \r\nJavaScript functions, cascading styles. \r\n• Worked with builder tools like Beaver Builder, IOL, Duda, GoDaddy, Orange and Yell \r\nMigration. \r\n• Ability to deal with people, grasp things fast, Strong Initiator, creative and willingness to work \r\nhas always been my strengths. \r\n• Excellent Client Interaction Skills and proven experience in working independently as well as \r\nin Team. \r\n• Creating a website using Styled Components in React Js \r\n• Updated knowledge in ES6 new Features\r\n\r\nWork Experience\r\n\r\nWeb Developer\r\nIndegene Pvt Ltd - Bengaluru, Karnataka\r\nJanuary 2021 to Present\r\n\r\nWork History:\r\n• Over 2 years of professional Web Design and development experience.\r\n• Used Html5, CSS3 and Used JavaScript for all client-side scripting.\r\n• Used Veeva vault to Create Presentations/Binders and to deploy the Files inside\r\npresentation.\r\n• Using Salesforce to manage the Build. And will be previewing the build once it is done.\r\n• Created the Presentations using TEXT, HTML, Image, and SVG(XML) approaches by\r\nusing Indesign file and illustrators.\r\n\r\nWeb developer\r\nVsplash Tech Labs - Hyderabad, Telangana\r\nMarch 2019 to August 2020\r\n\r\nWork History:\r\n• Used Html, CSS, and Bootstrap for Front end designing, JavaScript for all client-side\r\nscripting\r\n• Used WordPress framework for website development.\r\n• Was solely responsible for full life-cycle application development, Testing and maintenance.\r\n• Modernized client web pages to introduce responsive designs for tablets and mobile.\r\n\r\nEducation\r\n\r\nBachelor's in AERONAUTICAL\r\nCMR College of Engineering & Technology - Hyderabad, Telangana\r\n\r\n\f• Creatively talented web developer building dynamic, seamless online user experiences through \r\n\r\ncreation of robust websites integrating the latest in web technologies. Experienced with a variety of \r\nweb-based coding languages, including HTML5, CSS3, JavaScript and REACT JS, and skilled at \r\nintegrating user process flows to create a streamlined browsing experience. Adept at developing \r\ninformative content and graphics centered around ease of use and accessibility principles.\r\n\r\nSkills / IT Skills\r\n\r\n• Html5\r\n\r\n• CSS\r\n\r\n• Javascript\r\n\r\n• React Js\r\n\r\n• Photoshop\r\n\r\n• INDESIGN\r\n\r\n• ES6\r\n\r\nAwards / Achievements\r\n\r\nMAKE IT HAPPEN\r\nDecember 2021\r\n\r\nContext: Good Performance and Great Dedication towards work. \r\nRole: Shown great Ownership and kept communicating with team members to keep quality and to\r\nmeet timelines. \r\nOutcome: The passion shown to deliver project is remarkable, which is an important reason for the\r\nquality outcomes.\r\n\r\n\f",{"entities":[[0,17,"PERSON"],[19,39,"LOCATION"],[857,870,"ROLE"],[872,888,"ORGANISATION"],[913,936,"DURATION"],[1408,1421,"ROLE"],[1423,1440,"ORGANISATION"],[1465,1490,"DURATION"],[1860,1886,"EDUCATION"],[1888,1927,"INSTITUTION"],[2452,2549,"SKILLS"]]}]]}