{"classes":["PERSON","LOCATION","SKILLS","CONTACT","EMAIL","ROLE","ORGANISATION","DURATION","CERTIFICATE","PROJECTS","EDUCATION","INSTITUTION"],"annotations":[["Suman K\r\nKollam, Kerala\r\n-Email me on Indeed: http://www.indeed.com/r/Suman-K/ff6e333e38514ef7\r\n\r\nWeb developer with 2+ years of experience in working with small scale to large scale systems. During\r\nthis period I had \r\nhands-on experience in Requirement analysis, UI development, Coding, Deployment and Testing.\r\nExtremely disciplined \r\nand focused in my domain of work. \r\n \r\nCAREER PROFILE \r\n• Experience in Frameworks - Laravel. \r\n \r\n• Experience in Front-End development using HTML, CSS, Bootstrap, JavaScript, JQuery and \r\nJavaScript Frameworks. \r\n \r\n• Excellent analytical skills, ability to evaluate Client requirements and implement technical solutions. \r\n \r\n• Continuously monitoring industry trends, technologies and standards. \r\n \r\n• Dependable and motivated. Strong problem solving skills and the ability to work under pressure. \r\n \r\n• Dedicated and motivated learner. \r\n• Server Management: Shared Web Hosting. \r\n \r\n• Programming Experience: PHP, Laravel, Flutter, HTML5, CSS3, Flex Concept, Bootstrap, JavaScript, \r\nJQuery, Ajax. \r\n \r\n• DBMS: MySQL. \r\n \r\n• Awareness: Web Application Testing, Machine learning, Blockchain, IoT. \r\n \r\n• Keywords: iPage, CPanel, HTML, CSS, Javascript, Jquery, Bootstrap, PHP, Laravel, Modular Approach \r\nin Laravel, MySQL, Apache server, XAMPP, FTP, Git, Trello, Postman.\r\n\r\nWilling to relocate to: Kerala\r\n\r\nWork Experience\r\n\r\nWeb Developer\r\nWOFT Technologies Pvt. Ltd - Thodupuzha, KERALA, IN\r\nJune 2019 to Present\r\n\r\nThodupuzha http://woftech.com/\r\n\r\n• Designed, implemented and monitored web applications and websites for continuous improvement.\r\n\r\n\f• Utilized scripting languages to design websites under the supervision of lead developer.\r\n\r\n• Created web applications and components using a variety of technologies.\r\n\r\n• Fixed bugs from existing websites and implemented enhancements that significantly improved web\r\nfunctionality\r\nand speed.\r\n\r\n• Developed dynamic and interactive websites that ensured high performance and user experience.\r\n\r\n• Worked with team members to improve performance and implement training updates.\r\n\r\nEducation\r\n\r\nB. Tech in CSE\r\nCollege of Engineering Perumon\r\n2016 to 2019\r\n\r\nDiploma in CSE in CSE\r\nKerala Technical University\r\n2011 to 2014\r\n\r\n\f",{"entities":[[0,7,"PERSON"],[9,23,"LOCATION"],[396,431,"SKILLS"],[439,550,"SKILLS"],[955,1141,"SKILLS"],[1159,1316,"SKILLS"],[1373,1386,"ROLE"],[1388,1414,"ORGANISATION"],[1441,1461,"DURATION"],[2095,2109,"EDUCATION"],[2111,2133,"INSTITUTION"],[2159,2173,"EDUCATION"],[2182,2209,"INSTITUTION"]]}]]}