{"classes":["PERSON","LOCATION","SKILLS","CONTACT","EMAIL","ROLE","ORGANISATION","DURATION","CERTIFICATE","PROJECTS","EDUCATION","INSTITUTION"],"annotations":[["Suresh Vadde\r\nIN\r\n-Email me on Indeed: http://www.indeed.com/r/Suresh-Vadde/febbe349a3a1b271\r\n\r\n• I Have 3+ years of experience as a Microsoft Power BI Developer. \r\n• Possessive experience on Power BI and Paginated reports. \r\n• Experience in Requirement Analysis, Design and Development of reports and dashboards using\r\nPower BI Technology. \r\n• Hands-on experience in extracting data from various sources like SQL Server, Excel, Azure SQL DB to\r\npower BI depending on the client requirement. \r\n• Experience on having connections Direct mode and Live Models to connect with Data. \r\n• Modify and Transform the data using Power Query depending on the Client requirement. \r\n• Creating Measures and Calculated Columns using DAX operations in Power BI and Optimizing DAX\r\nqueries using DAX Studio. \r\n• Creating Workspaces, assigning roles and further sharing Reports and Dashboards to the clients on\r\nPower BI Services. \r\n• Creating composite models for customers to build their own customized reports. \r\n• Creating and Embedding reports and Data flows. \r\n• Experience in Installing and configuring Gateways to refresh the data and to automate the refresh for\r\nPower BI reports to be up to date with the data. \r\n \r\n• Good experience in SQL and T SQL. \r\n• Regularly involved in Client calls with business users to update and discuss the status including the\r\nnew requirements of the project.\r\n\r\nWilling to relocate to: Bengaluru, Karnataka - Pune, Maharashtra\r\n\r\nWork Experience\r\n\r\nDevelopment Associate\r\nSBI Life Insurance - Hyderabad, Telangana\r\nOctober 2020 to Present\r\n\r\nOctober 2020 - Till date.\r\nCurrent Company: SBI LIFE.\r\n\r\nEducation\r\n\r\nB.SC in Computers\r\nSRIKRISHNA DEVARAYA UNIVERSITY\r\n\r\nSkills / IT Skills\r\n\r\nreview meetings.\r\n\r\n• Strong Communication and Presentation skills, and will be able to handle Client calls and Business\r\n\r\n• Good hands-on Experience Creating and presenting reports and dashboards on Power BI.\r\n\r\n\f• Comprehensive knowledge of Data design & visualization techniques in Power BI Desktop, Data\r\n\r\nManagement, Data Modelling, and Analysing. PROJECTS HANDLED Project 1: HDFC SALES\r\n\r\n• Sales Analysis HDFC Sales private Ltd is a recognized home loan service at home in India having vast\r\nexperience and loan leadership. HDFC Sale's services include home loans, sales-giving services and\r\nloan insurance programs. We manage and create reports for the data of daily sales of employee and\r\nproduct details that include data coming from varying hierarchies and Locations. Responsibilities:\r\n\r\n• Creating Daily, Weekly and Monthly, Quarterly, Yearly and so many different kinds of reports as per\r\n\r\nmy Business and the client requirements.\r\n\r\n• Experience on Formatting visuals and creating Filters in Visual level, page level, Drill through and\r\n\r\nReport level in Power BI.\r\n\r\n• Worked on DAX expressions like filters, time intelligence functions, Aggregations and Mathematical\r\n\r\nfunctions to create measures and calculated columns.\r\n\r\n• Creating Row level security with power bi and integration with power bi service portal. Implemented\r\n\r\nRole Based Security as part of user level security in Power BI.\r\n\r\n• Creating Workspaces for team collaboration purposes, adding members to workspace and Assigning\r\n\r\nroles. Project 2: Investment Business Analysis\r\n\r\n• SBI LIFE. SBI Life Insurance Company Ltd.\r\n\r\n• also known as SBI\r\n\r\n• is an Indian multinational insurance corporation with more than 31 million customers in 950 cities.\r\nSBI LIFE company's employees over 14,000 people in 28 states. The company operates through\r\nthree businesses: SBI Bancassurance, Retail Agency and Direct Sales. Responsibilities:\r\n\r\n• Participated in requirements meetings and Scrum Calls to understand the Report Requirements.\r\n\r\n• Used Power Query / Query Editor for Data transformation as per the reporting needs.\r\n\r\n• Created Data Model in Power Pivot by Establishing the Relationship Between the tables.\r\n\r\n• Enhanced the Data Model by creating New Columns and New Measures using DAX.\r\n\r\n• Developed at least two\r\n\r\n• three visual options for each report for discussion with stakeholders and customers.\r\n\r\n• Created Hierarchies and Drilldown Reports.\r\n\r\n• Created Microsoft Power BI Dashboards in Power BI Service using Reports.\r\n\r\n• Installed and Configured Data Gateways to Refresh and Schedule Refresh the Dataset.\r\n\r\n• Managed access of Reports, Dashboards and Data for individual users using roles.\r\n\r\n• Implemented Row Level Security as part of Security.\r\n\r\n• Provided continued maintenance and development of bug fixes for the existing and new Power\r\nBI Reports. TECHNOLOGIES: OPERATING SYSTEM WINDOWS 8/8.1/10 DATABASES MySQL, SQL\r\nServer 2016, SQL Server 2017 POWER BI Power BI Desktop. POWER BI SERVICES POWER BI REPORT\r\nBUILDER DAX STUDIO\r\n\r\n• Computer skills\r\n\r\n• Microsoft Excel\r\n\r\n• Power Bi\r\n\r\n\f",{"entities":[[0,12,"PERSON"],[1475,1496,"ROLE"],[1498,1516,"ORGANISATION"],[1541,1564,"DURATION"],[1638,1655,"EDUCATION"],[1657,1687,"INSTITUTION"],[1700,2067,"SKILLS"],[4626,4703,"SKILLS"],[4704,4757,"SKILLS"],[4784,4813,"SKILLS"]]}]]}