{"classes":["PERSON","LOCATION","SKILLS","CONTACT","EMAIL","ROLE","ORGANISATION","DURATION","CERTIFICATE","PROJECTS","EDUCATION","INSTITUTION"],"annotations":[["Sivakumar S\r\nChennai, Tamil Nadu\r\n-Email me on Indeed: http://www.indeed.com/r/Sivakumar-S/7cc496b3ce5924c1\r\n\r\nAn accomplished Digital Project Managing professional with 8 years of comprehensive \r\nexperience working in a digital environment. Highly recognized for multitasking and implementing \r\nmultiple digital projects within budget, deadline orientated, optimizing ROI and building strong \r\nRelationships.\r\n\r\nWilling to relocate: Anywhere\r\n\r\nWork Experience\r\n\r\nDigital Marketing Specialist\r\nGoogle Adwords\r\nDecember 2019 to Present\r\n\r\nDeveloped and managed digital pay-per-click advertising programs using Google Adwords,\r\n\r\nFacebook, and third party content distribution networks.\r\n• Performed monthly adjustments on accounts/campaigns in Google AdWords and social\r\n• media channels in order to maximize performance within current budget.\r\n• Produced monthly performance reports for clients for SEM programs utilizing reporting tools\r\nsuch as Google Analytics; determined key metrics that were of primary importance to clients\r\nand provided trending data to compare results month-by-month.\r\n• Supported business development through the development of comprehensive multi -channel\r\ndigital advertising programs, written proposals and client presentations based on analysis of prospect's\r\nlong-term goals and available budget.\r\n• Implemented SEO strategies for client websites including layout, content optimization,\r\nkeyword structuring, etc.\r\n• Assisted in providing ROI analysis of clients digital marketing campaigns.\r\n• Proven understanding and implementation of pay-per-click, search engine optimization,\r\ngoogle analytics and data analysis.\r\n\r\n• Lead generation campaigns on Google Ads, Facebook, and LinkedIn for a better ROI.\r\n\r\nSr.Digital Marketing Executive\r\nVisnukumar Traders Pvt Ltd\r\nOctober 2016 to December 2019\r\n\r\n• Designed and implemented SEO strategy.\r\n\r\n• Keyword Research for all pages.\r\n\r\n• Audience and competition research for the website.\r\n\r\n• Content development for website and guest post campaigns.\r\n\r\n\f• Setup performance tracking on Google Analytics, GTM, AdWords, Search Console, Dashboard.\r\n\r\nDigital Marketing Executive\r\nDLK Technologies\r\n2014 to 2016\r\n\r\n• Creating, implementing and managing SEO campaigns.\r\n• Campaigns include keyword research, development of content and link building strategies,\r\ncontent marketing, and improving local visibility.\r\n• Develop, optimize, and audit legal websites to ensure proper performance, visibility, and accessibility.\r\n• Consult clients on SEO best practices, social media, content creation, and manage client\r\nexpectations.\r\n• Creation of monthly SEO reports notifying clients of site traffic, goals, and other KPIs as well\r\n• as health of SEO campaign and upcoming projects plans.\r\n• Help manage and train new hires on SEO best practices, client consulting, and project\r\nmanagement..\r\n\r\nBE in Electronics and communication Engineering\r\nSrinivasan College Of Engineering and technology - Chennai, Tamil Nadu\r\n2008 to 2012\r\n\r\n• Marketing Communications, Market Research And Analysis, Google Ad-words, Social Media \r\n\r\nCampaign Management, Market Research And Analysis, Website Analytics, Google Analytics, SEO \r\nOptimization, Word Press Site Development, Brand Promotion Strategies, Web User Experience \r\nAnalysis, Marketing Analytics, Market Research, Digital Photography, Design Layout, Amazon & \r\nFlipkart Ad Campaign Management.\r\n\r\nEducation\r\n\r\nHSC\r\nGovt.Hr.Secondary School\r\n2007 to 2008\r\n\r\nSSLC\r\nGovt.Hr.Secondary School\r\n2006\r\n\r\nSkills / IT Skills\r\n\r\n• Digital marketing\r\n\r\n• Marketing\r\n\r\n• Google AdWords\r\n\r\n• SEO\r\n\r\n• SEM\r\n\r\nOnline Profile\r\n\r\nhttp://Sr.Digital\r\n\r\n\f",{"entities":[[0,11,"PERSON"],[13,32,"LOCATION"],[465,493,"ROLE"],[511,535,"DURATION"],[1741,1771,"ROLE"],[1773,1799,"ORGANISATION"],[1801,1830,"DURATION"],[2129,2156,"ROLE"],[2158,2174,"ORGANISATION"],[2176,2188,"DURATION"],[2868,2915,"EDUCATION"],[2917,2965,"INSTITUTION"],[3007,3411,"SKILLS"],[3428,3431,"EDUCATION"],[3433,3457,"INSTITUTION"],[3475,3479,"EDUCATION"],[3481,3498,"INSTITUTION"]]}]]}