{"classes":["PERSON","LOCATION","SKILLS","CONTACT","EMAIL","ROLE","ORGANISATION","DURATION","CERTIFICATE","PROJECTS","EDUCATION","INSTITUTION"],"annotations":[["Soumo Deep Nandy\r\nPragmatic, data driven and result oriented professional with more than 11 years of\r\nexperience in: Brand & Product Management I Digital Marketing I Business Development\r\nI Forecasting & Research I Strategy Formulation I Go to Market Plans I Customer Value\r\nProposition I Media & Advertisements I Channel Management\r\nNoida, Uttar Pradesh\r\n-Email me on Indeed: http://www.indeed.com/r/Soumo-Deep-Nandy/a4f6f87674958f86\r\n\r\nLooking for a job opportunity across sectors to apply the best of my skills and experience in Marketing.\r\nWorks as a Consultant to leading Digital Marketing Agency and also a marketing blogger.\r\n\r\nWilling to relocate to: Noida, Uttar Pradesh - Bangalore Urban, Karnataka - Pune, Maharashtra\r\n\r\nPersonal Details\r\n\r\nDate of Birth: 1984-09-30\r\nEligible to work in: India, United Kingdom, United States\r\n\r\nWork Experience\r\n\r\nMarketing Manager\r\nIPG PHOTONICS - Noida, Uttar Pradesh\r\nOctober 2017 to Present\r\n\r\n• Conduct Market Research, Business and Data Analysis of\r\ncompetitor movements and suggest key insights of their activities to\r\nmanagement. Have been able to retain leadership position in\r\nIndian market by keeping competitors at bay\r\n• Formulate Go To Market Plans and Strategies for new product\r\nlaunch. Communicating product development areas and feedback\r\nand competitor products' unique features to product development\r\nteam for feasibility study and further incorporation. Established a\r\ncomplete separate business vertical for these products.\r\nOverseeing the onboarding process of channel partners and\r\nresellers on turnkey basis\r\n• Communicate with various media buyers, advertising\r\nagencies, vendors, and other services to help marketing projects\r\ncome to fruition\r\n• Executing digital marketing campaigns on Google Ads and\r\nYou Tube especially and manage the entire inbound lead flow\r\nprocess, follow up with customers and conversions. Key focus on\r\nre‑targeting ads for industry specific B2B requirements\r\n• Measuring and improving the effectiveness of demand\r\ngeneration efforts by creating various ad groups and ads and\r\nsticking on the best performing ads based on goals. Generated a\r\nhuge pipeline of leads in one month, around 250 nos., of which 6%\r\n\r\n\fconverted. Took care of the entire conversion process as well\r\n• Planned and executed all other digital marketing avenues as\r\nwell like email campaigns, social media campaigns on Linkedin\r\n• Measure and report performance of all digital marketing\r\ncampaigns and assess against goals (ROI and KPIs)\r\n• Approve and oversee the creative development of promotional\r\nmaterials, content creation, advertisements, and other\r\nmarketing‑related projects\r\n• Understand how new leads are flowing through the lead\r\nlifecycle across various stages and continually recommend new\r\nstrategies and tactics for optimization\r\n• Responsible for contributing a revenue of USD 1.2 million\r\n• Assist and attend Industry Trade Shows. End to end execution of\r\nevents, webinars, trade shows\r\n\r\nDeputy Manager\r\nGHCL Limited - Noida, Uttar Pradesh\r\nDecember 2013 to September 2017\r\n\r\n• Successfully built platforms for all internal and external\r\ncommunications of the organization. Have been instrumental in\r\nestablishing the brand of GHCL across all mediums\r\n• Handle and working cohesively with\r\nagencies/vendors/partners for steering creative and PR strategies\r\nof the company and drafting of the right messages for the media\r\n• Played a prominent role in launching the organizationʼs new\r\nwebsite with added features and technology. Responsible for\r\nhandling the website of the company and Digital brand presence of\r\nthe company\r\n• Planned and executed all digital marketing, including SEO/SEM,\r\nmarketing database, email, social media and display advertising\r\ncampaigns\r\n• Measure and report performance of all digital marketing\r\ncampaigns and assess against goals\r\n• Coordinate with agencies for campaign planning and ensuring\r\noptimum utilization of media budgets for brand campaigns\r\n• Support sales team in entire marketing and promotion activities\r\nthrough various channels, medium and other networking\r\n• Instrumental in designing and establishing corporate brand\r\nguidelines and developing branding material\r\nWork closely with the product marketing and the sales team for the\r\nplanning and execution of various MARCOM activities\r\n\r\nMarketing and Communications Executive\r\nM/s SGS India Private Ltd - Gurgaon, Haryana\r\nFebruary 2012 to November 2013\r\n\r\n• Manage all client queries related to Clean Development\r\nMechanism (CDM) under the United Nations Framework on\r\nConvention Climate Change Projects and Voluntary Greenhouse Gas\r\n\r\n\fEmission (GHG) projects and managing them sequentially to\r\ngenerate business throughout India, Middle East and South‑east\r\nAsia Pacific.\r\n• Responsible for generating the monthly and annual revenue\r\nfrom CDM projects\r\n• Conduct market analysis and understand the latest market\r\ntrends and competitor analysis ahead to achieve the target by\r\nproviding appropriate solutions during negotiations and finalizing of\r\ncontracts.\r\n• Handle all PSU enquiries for bid submission with viable and\r\nacceptable Terms and Conditions.\r\n• Conceptualize and implement revenue generating business\r\nstrategies, establish business relations with clients and developing\r\npenetration strategies to achieve targets\r\n• Handle and manage a large client portfolio across SEAP, Middle\r\nEast and Africa region\r\n• Generating new business for CDM and other Voluntary and\r\ncompliance market projects.\r\n• Handle the launch of new service , which includes BTL\r\npromotion and marketing of Training services on GHG inventories,\r\nProduct Carbon Footprinting and ISO 14064. Coordinating with the\r\nMarketing Communications team for the promotion and designing of\r\nthe campaign\r\n\r\nSales Engineer\r\nMetal Power Analytical (India) Pvt. Ltd - Jamshedpur, Jharkhand\r\nJuly 2010 to January 2012\r\n\r\n• Responsible for managing marketing, sales BTL in 4 states in\r\nthe eastern zone.\r\n• Tracks all marketing and sales data and creates detailed written\r\nreports and verbal presentations to bring to senior executives\r\n• Execute and maintain sales processes and initiatives in\r\naccordance with a documented operational plan\r\n• Oversee current offerings and comes up with initiatives for new\r\nproducts or services\r\n• Manage vendor and internal stakeholder relationships\r\n• Promote business and penetrating new markets to enhance\r\nbusiness development through formal presentation to ensure target\r\nachievement\r\n• Conceptualize/ implement revenue generating business\r\nstrategies, establish business relations with clients, thereby\r\nensuring higher market share. Manage key accounts, exceed sales\r\ntargets & penetration strategies to achieve targets.\r\n\r\n\fEducation\r\n\r\nMasters in Business Administration in Business Administration\r\nM.S.Ramaiah Management Institute - Bengaluru, Karnataka\r\nJuly 2008 to June 2010\r\n\r\nBachelor's in Electronics\r\nSiliguri Institute of Technology - Shiliguri, West Bengal\r\nJune 2002 to July 2006\r\n\r\nSkills / IT Skills\r\n\r\n• Digital Marketing\r\n\r\n• Business Analysis\r\n\r\n• Seo\r\n\r\n• Ppc\r\n\r\n• Market Research\r\n\r\n• Offline Marketing Activities\r\n\r\n• Team Management\r\n\r\nLanguages\r\n\r\n• English - Expert\r\n• Hindi - Expert\r\n• Bengali - Expert\r\n\r\nOnline Profile\r\n\r\nCompleted 4 months of Digital Marketing certification course from Edupristine\r\n\r\nhttp://www.linkedin.com/in/soumodeepnandy\r\n\r\nCertifications and Licenses\r\n\r\nDigital Marketing\r\nMay 2015 to Present\r\n\r\nBusiness Analyst\r\nAugust 2016 to Present\r\n\r\nCompleted Business Analyst course from Manipal ProLearn\r\n\r\nAdditional Information\r\n\r\nMy website: https://myopiamarketing.com/\r\n\r\n\f",{"entities":[[0,16,"PERSON"],[334,354,"LOCATION"],[859,876,"ROLE"],[878,891,"ORGANISATION"],[916,939,"DURATION"],[2980,2994,"ROLE"],[2996,3008,"ORGANISATION"],[3033,3064,"DURATION"],[4328,4366,"ROLE"],[4368,4393,"ORGANISATION"],[4414,4444,"DURATION"],[5771,5785,"ROLE"],[5787,5826,"ORGANISATION"],[5852,5877,"DURATION"],[6741,6775,"EDUCATION"],[6804,6836,"INSTITUTION"],[6887,6912,"EDUCATION"],[6914,6946,"INSTITUTION"],[7023,7157,"SKILLS"],[7252,7392,"CERTIFICATE"]]}]]}