{"classes":["PERSON","LOCATION","SKILLS","CONTACT","EMAIL","ROLE","ORGANISATION","DURATION","CERTIFICATE","PROJECTS","EDUCATION","INSTITUTION"],"annotations":[["Venkata P\r\nVisakhapatnam, Andhra Pradesh\r\n-Email me on Indeed: http://www.indeed.com/r/Venkata-P/a821f2ab355cbf34\r\n\r\nI work full-time at Honeyy Group as an SEO specialist where my responsibilities are to manage their\r\nsocial media postings and everything related to search, keywords, and analytics. I am also associated\r\nwith the design and content managing aspects of the company's social media campaigns. \r\n \r\nMy other responsibilities include the management of social media pages for the CMD, both personal\r\nand business. I am concerned with the design of posters and campaigns related to any events at the\r\ncompany, national and international events, and most trending topics. \r\n \r\nImportantly, I keep myself up-to-date with the fast-moving Digital marketing landscape, particularly\r\ntechnological and search engine trends, changing algorithms, and ranking factors. I understand the\r\nimportance of always staying one step ahead in this dynamic and ever-changing field.\r\n\r\nWork Experience\r\n\r\nDigital marketing Specialist\r\nSEO- Digital Marketing\r\nSeptember 2018 to Present\r\n\r\nWorking as a Senior digital marketing executive in HoneyyGroup.\r\nAs a DME I have been optimized the website content and SEO,SMO,SMM.\r\n\r\nEducation\r\n\r\nMaster's in MBA\r\nRise School Of Management - Ongole, Andhra Pradesh\r\nOctober 2009 to May 2011\r\n\r\n• Most active participant certification on Digital Marketing day at Dhunis Technologies.\r\n\r\n• Knowledge in Adobe Illustrator, Video Editing, Photoshop\r\n\r\nSkills / IT Skills\r\n\r\n• Digital Marketing\r\n\r\n• Photoshop\r\n\r\n• Illustrator\r\n\r\n• Marketing\r\n\r\n• SEO\r\n\r\n• Google Analytics\r\n\r\n\fLanguages\r\n\r\n• Telugu - Expert\r\n• English - Intermediate\r\n\r\n\f",{"entities":[[0,9,"PERSON"],[11,40,"LOCATION"],[1049,1074,"DURATION"],[1091,1125,"ROLE"],[1129,1141,"ORGANISATION"],[1227,1242,"EDUCATION"],[1244,1269,"INSTITUTION"],[1418,1474,"SKILLS"],[1478,1597,"SKILLS"]]}]]}