{"classes":["PERSON","LOCATION","SKILLS","CONTACT","EMAIL","ROLE","ORGANISATION","DURATION","CERTIFICATE","PROJECTS","EDUCATION","INSTITUTION"],"annotations":[["GAGAN GUPTA \r\n\r\n \r\n\r\n279, 1st Floor Lumbini Apartments, Sec-14 Kaushambi,  Ghaziabad \r\n\r\nEmail : gagangupta0707@gmail.com, Mobile: +91 8860829101 \r\n\r\nHave more than 10 years of experience in Finance domain majorly in Transition management for R2R. Confident, \r\nHardworking, and believe in doing my best every day.  \r\n \r\nProcess Migrations   \r\n \r\n\r\n  Did multiple transitions for Western Europe Clients for Barclays (London) and for Wipro (Sweden and Finland) \r\n\r\nfor finance and accounting F&A process. \r\n\r\n  Have strong exp in end to end Transition Management Review and Created the SOP and Transitions  process \r\nflow documentation, SOP, volume analysis, headcount requirement analysis, system support, pilot phase \r\nmonitoring & Go Live scheduling. \r\n\r\n \r\nProfessional Experience \r\n \r\nMotivation Speaker and life coach ( Nov 2015 to till date) \r\n \r\n\r\n  Currently on carrier break perusing my passion as motivation speaker and success coach managing my Youtube \r\n\r\nchannel taking sessions, looking forward for an exciting opportunity. \r\n \r\nI am committed to life by lifelong learning and bringing change in people’s life by encouraging them to achieve \r\nhigher goals and dreams that they are holding in their mind by explaining methodology for success so that they \r\ncould live happier, more productive lives. \r\nI am committed to taking care of myself so that I will be healthy both mentally and physically to bring joy and \r\nhappiness in life. \r\nI am committed to taking care of my own responsibilities. I look to God for wisdom and guidance through life's \r\ndaily challenges. \r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\n \r\nYoutube channel link- \r\n \r\n https://www.youtube.com/channel/UCnsIGCgX0cvFL_vzQcfrtLQ/videos \r\n \r\nWipro Ltd, BPO. (Feb 2015 to Nov 2015) \r\n \r\nDeputy Manager in Finance Domain Managing GL Reconciliations Team for one of the major European Client \r\nOutokumpu (Global leader in stainless steel). \r\n \r\n\r\n  Ensure Service Level Agreements (SLAs) for the processes are met as agreed upon with client.  \r\n  Do audit of the reconciliations to ensure the quality of recs and aged items resolutions. \r\n  Setting goals of team members & monitoring the performance on a monthly basis. \r\n  Responsible for Monthly one to one discussions and Yearly appraisals of the team members. \r\n  Drive optimization initiatives and ensure continuous improvement in processes. \r\n  Balanced work allocation of the team members and ensuring 100% cross training. \r\n \r\n\r\n Managing Team activities involving raising Journals, keep all controls in place for month end closings and \r\nmitigating risk of failing SLA’s. \r\n\r\n  Provide daily updates to the onshore counterparts about the issue log and update them with resolutions and \r\n\r\ncertain findings. \r\n\r\n \r\n \r\nBarclays Shared Services (Sep 2008 to Feb 2015)  \r\n \r\nTeam Support Specialist in Finance Domain managing Gl Reconciliations and General Accounting teams. \r\n\r\n \r\n\r\nPage 1 of 2 \r\n\r\n\fGAGAN GUPTA \r\n\r\n \r\n \r\nKey Responsibilities: \r\n \r\n\r\n  Reconciling, analyzing & reviewing various Balance Sheet accounts, Bank Accounts & Intercompany \r\n\r\nAccounts and preparing various  journals. \r\n\r\n  Key area of operations is R2R, with the below responsibilities to take care for UK Retail banking and \r\n\r\nBarclaycard business for monthly closing and reporting for different SBUs. \r\n\r\n  Clearance of suspense account and settlement of Bad and Doubtful debtors on quarterly basis. \r\n  Quarterly clear down of P&L for UK Branches with Treasury. \r\n \r\n\r\nImpart necessary process related training to team members wherever necessary and provide efficient support to \r\nteam to handle all kind issues or queries with in process. \r\n\r\n  Work closely with Team Manager to build/update process related controls. \r\n\r\n \r\n \r\nKey Achievements \r\nSuccessful migration of new processes and streamlined the same in short span of time. \r\nProcess improvements thru building new control, WB project to mitigate risk. \r\n \r\nGENPACT ( May-2006- to Sep 2008 ). \r\n \r\n\r\nI had worked closely with the business on intercompany and Equity Investment Reconciliations. \r\n\r\n  Worked as a Process Expert with GENPACT for the GE Commercial Finance Business \r\n \r\n  Managing the Cash Reconciliations Process and analyzing. \r\n  Leading calls with the customers for the follow up on the open items. \r\n  Reviewing and quality assurance of the Reconciliation of the team members. \r\n  Monthly Cash Close activity including Preparing manual journal entries,Transfer of balances to correct GL. \r\n  Keeping the track on all the entries posted in the default analysis codes. \r\n  Research work on all open items and providing its resolution to the industry. \r\n \r\n\r\nCitizen Co-operative Bank Ltd (Aug 2003 to May 2006) \r\n \r\nWorked as a Senior Executive. During the tenure, I had managed following: \r\n \r\n\r\n  Disbursement of Personal Loan, Home Loan, Loan against deposit. Document processing & follow up’s \r\n  Preparing Outstanding and Overdue Loan report at every month end, tracking and following up the same. \r\n  Deposits: Fixed Deposits, Recurring Deposits, Saving & Current Accounts. \r\n  Transfers: Inter branch Transactions (Remittance), Issuing PO, Drafts, inter account entries & Fund transfers \r\n  Reconciling GL Accounts and rectifying the difference by passing necessary entries in the respective account. \r\n  Making Inter-branch transaction vouchers related with transfer both manually and computerized. \r\n  Applying interest (both debting (Loan A/C) and Credit (Deposits A/c)) during month ends and closings. \r\n  Processing of Inward and outward clearing.Managing cash receipts/payment counters.Handling reconciliation of \r\nbank entries/ GL Heads and Preparing Management Information system (MIS) Reports at the Every Month \r\nEnd.Getting general ledger book, daybook and cash book at day closing. \r\n\r\n  Authorization/Final Check on entries (transactions whether by cash, clearing or Transfer) before they get posted \r\n\r\non A/c. \r\n\r\n \r\nQualifications \r\n \r\n (1999-2002)   -  BBA- Bachelor of Business  Administrations (Finance). Mahatma Gandhi Kashi Vidyapith  University.\r\n \r\nPersonality traits/ strengths \r\n \r\n\r\n \r\n\r\n  Strong analytical, problem solving, inter-personal, and communication skills. \r\n  Proficient in working on MS Office, pivot, data modeling, ppts, etc.Effective team player, believe in open \r\n\r\n \r\n\r\nPage 2 of 2 \r\n\r\n\fGAGAN GUPTA \r\n\r\ncommunication, share information with peers, mentor new comers and team members. \r\n \r\n\r\n \r\n\r\nPersonal Details: \r\n \r\n\r\n  Date of Birth  \r\n  Marital Status \r\n  Passport \r\n \r\n\r\n \r\n \r\n \r\n\r\n: \r\n: \r\n: \r\n\r\nJuly 07, 1980 \r\nMarried \r\nValid Passport  \r\n\r\n \r\n\r\nPage 3 of 2 \r\n\r\n\f",{"entities":[[0,11,"PERSON"],[21,84,"LOCATION"],[97,121,"EMAIL"],[131,145,"CONTACT"],[1705,1714,"ORGANISATION"],[1722,1742,"DURATION"],[1749,1814,"ROLE"],[2744,2768,"ORGANISATION"],[2770,2790,"DURATION"],[2798,2839,"ROLE"],[3930,3937,"ORGANISATION"],[3940,3961,"DURATION"],[4085,4099,"ROLE"],[4655,4684,"ORGANISATION"],[4686,4706,"DURATION"],[4725,4742,"ROLE"],[5983,6035,"EDUCATION"],[6037,6080,"INSTITUTION"],[6213,6275,"SKILLS"]]}]]}