{"classes":["PERSON","LOCATION","SKILLS","CONTACT","EMAIL","ROLE","ORGANISATION","DURATION","CERTIFICATE","PROJECTS","EDUCATION","INSTITUTION"],"annotations":[["Kunal Wadhwani.\nAhmedabad, Gujarat\n-Email me on Indeed: http://www.indeed.com/r/Kunal-Wadhwani/ed61ca55c818832e\n\nPassionate Food Technologist with 10 years of employment history & Entrepreneurial experience \nadept at the bakery, confectionery, snacks, food ingredients, flavors, sauces, seasonings, plant-based,\nand healthy products. A self-driven, creative, problem-solving, and focused leader with high integrity.\nBelieve in enhancing my skills by taking up challenges to have a better career progression path.\n\nWilling to relocate to: England - Scotland - Wales\n\nWork Experience\n\nDirector of Research and Development\nNosh Enterprise LLP - Ahmedabad, Gujarat\nSeptember 2017 to Present\n\n•  Managing  6  Verticals  (Bakery,  Confectionery,  Snacks,  Food  ingredients,  Plant-based,  and  Healthy\nproducts)\n• Partnering and collaborating with Clients by negotiating contracts and agreements\n•  Consulting  clients  from  the  new  product  ideation  stage  to  the  prototype  development  stage,  and\nrecommending unit operations to scale up\n•  Creating  healthy  products  such  as  Rye  &  Fiber-rich  bread,  \"Keto  Nutrition\"  bars  as  per  Client's\nrequirement and further assisting them for processing\n• Developing meat like nuggets using defatted soya flour along with other ingredients results in high\nprotein (around 50 - 55%) with very low moisture\n• Analyzed Egg-based aerated filling cream with 45 days of shelf-life\n• Producing chicken-like product named \"Soya Chaap\" by using gluten and soy protein, & putting the\nfinal product in freezer storage which resulted in meat-like taste & texture\n•  Developing  high-fat  shortbreads  with  extended  shelf-life  &  low  water  activity  &  puffed  pastry  with\nsavoury fillings for key customers\n• Formulating customized coffee and other food products for B2B and B2C sales\n• Developing business development strategies focused on financial gain\n• Budget monitoring, strategic planning, market analysis to fulfil the client's objective\n• Promoting products on the e-commerce platform to achieve valuable customers\n• Identifying new markets and establishing customer needs to amplify ROI\n• Creating consolidated invoices to ensure the smooth process of streamlining the business\n• Establishing long-term relationships with existing & new clients for growth of the firm\n\nGroup Development Technologist\nReal Good Place Plc - Liverpool\nMay 2016 to May 2017\n\n• Lead new product development from conception to the commercialization stage which includes product\nformulation, customer approvals, pilot plant trials, full-scale production trial, supermarket launch, and\nproduct behaviour during its full shelf-life\n• Developed bakery & confectionery products such as color printable sugar paste, bakery fillings, instant\ndry glaze, replacing animal proteins with plant proteins in products\n\n\f• Developed croissants with bake stable fillings to withstand high temperature as much as 200°C\n• Strong understanding of ingredients, their functions, and applications\n• Single-handedly managed product development projects with food hygiene & safety\n•  Handled  R&D  projects  (finished  bakery  products)  for  Subsidiary  companies  such  as  R&W  Scott\n(Scotland) & Haydens (England)\n• Worked closely with the marketing team to understand customer expectations and deliver trial products\nas per specifications derived from market research\n• Formulated new flavor creations & modified existing flavors to meet project requirements\n• Explored new raw materials & technology to solve the major challenges such as reduced sugar and\nfat % from formulation\n• Extended shelf life of products and enhanced/matched the flavor notes of the product\n• Frequently travelled within the EU to visit manufacturing units & vendors for product trials & testing\n\nDevelopment Technologist\nJ.F. Renshaw - Liverpool\nJanuary 2012 to May 2016\n\n•  Developed  high-fat  shortbreads  with  extended  shelf-life  &  low  water  activity  &  puffed  pastry  with\nsavoury fillings for key customers\n•  Enhanced  my  skills  in  product  development  from  conceptualization  to  commercialization  stage  by\ntaking the smallest detail into consideration\n•  Prepared  bakery  &  confectionery  products  such  as  glazing,  fillings,  icings,  sugar  pastes,  frostings,\nfondants, and marzipan\n• Innovated new products by R&D, recipe formulation, quality assurance, lab trials and shelf-life testing\n• Resolved complex issues such as problems using natural colors, different hydrocolloids & emulsifiers\n• Ensured flavor creation to stay up to the trend in the market and demonstrated products to supermarket\nbuyers\n• Dealt with international customers with a deep understanding of EU legislation and code I'd practices\n• Handled team projects with a go-getting attitude\n\nLaboratory Assistant\nSymrise - Corby\nJune 2010 to September 2011\n\n• Developed snack flavors and several culinary products in research and development lab\n• Improved various savoury flavors (seasonings) by understanding the characteristics of each ingredient\n• Enhanced culinary products such as curry sauces, pastes, pesto, different beef, chicken, pork stocks,\nwith effectively carrying out quality tests such as acids, salt, solids, viscosity & water activity\n•  Measured  existing  flavors,  created  new  flavors  and  conducted  various  sensory  tests  by  handling\ndifferent projects\n• Explored U.K. & international market about different foods in snack flavors, chilled & frozen products\n\nEducation\n\nM.Sc. in Food Production Management in Food Production Management\nUniversity of Nottingham - Nottingham\n2009 to 2010\n\n\f• Hard skills: Sensory Evaluation Formulation development Laboratory Trials Food Safety\n\n• Soft skills: Analytical & numerical skills Attention to detail Leadership skills Time management\n\nSkills / IT Skills\n\n• Product Development\n\n• Product Demos\n\n• Business Development\n\n• E-Commerce\n\n• Strategic Planning\n\nOnline Profile\n\nhttp://www.linkedin.com/in/kunal-wadhwani88\n\n\f",{"entities":[[0,15,"PERSON"],[16,25,"LOCATION"],[27,34,"LOCATION"],[124,141,"ROLE"],[147,155,"DURATION"],[538,545,"LOCATION"],[548,556,"LOCATION"],[559,564,"LOCATION"],[583,619,"ROLE"],[620,639,"ORGANISATION"],[642,651,"LOCATION"],[653,660,"LOCATION"],[661,686,"DURATION"],[2329,2359,"ROLE"],[2360,2379,"ORGANISATION"],[2382,2391,"LOCATION"],[2392,2412,"DURATION"],[3201,3209,"LOCATION"],[3222,3229,"LOCATION"],[3791,3815,"ROLE"],[3816,3828,"ORGANISATION"],[3831,3840,"LOCATION"],[3841,3865,"DURATION"],[4787,4807,"ROLE"],[4808,4815,"ORGANISATION"],[4818,4823,"LOCATION"],[4824,4851,"DURATION"],[5495,5530,"EDUCATION"],[5561,5585,"INSTITUTION"],[5588,5598,"LOCATION"],[5599,5611,"DURATION"],[5629,5647,"SKILLS"],[5648,5659,"SKILLS"],[5660,5671,"SKILLS"],[5672,5689,"SKILLS"],[5690,5701,"SKILLS"],[5718,5740,"SKILLS"],[5786,5801,"SKILLS"],[5825,5844,"SKILLS"],[5848,5861,"SKILLS"],[5865,5885,"SKILLS"],[5889,5899,"SKILLS"],[5903,5921,"SKILLS"]]}]]}