{"classes":["PERSON","LOCATION","SKILLS","CONTACT","EMAIL","ROLE","ORGANISATION","DURATION","CERTIFICATE","PROJECTS","EDUCATION","INSTITUTION"],"annotations":[["SELVAM MOORTHY\r\n\r\n736, South Street, India, Po-622515\r\n\r\nE-mail: mspcivil52@gmail.com T: +91-8608235389.\r\n\r\nCareer Objective:\r\n\r\nTo work in an engineering enterprise, which provides world-class engineering solutions where I can \r\n\r\ncontribute to the organization. With my honest and efficient service. To make a career in the field of civil \r\n\r\nengineering I would like to take guidance of senior authority and follow rules and regulations towards company. I \r\n\r\nhave strong developing skills to develop strategy as well as organizational profit. For the post of civil engineering I \r\n\r\nwould like to adapt new techniques, strategy to improve business in marketing environment. I have talent to \r\n\r\ninternship with in your company where I will utilize my developed skills in construction planning, executions, \r\n\r\nproject management and QA/QC also quantity surveying. Looking for a civil engineering position in construction \r\n\r\nplanning, executions, project management and consultant QA/QC also quantity surveying and strong analytical \r\n\r\nskills to make company strategy.\r\n\r\nExperience Summary:\r\n\r\nCivil engineering design, planning, executions, project management and QA/QC also quantity surveying. I \r\n\r\nhave highly competent individual who has extensive knowledge and experience of managing, directing and \r\n\r\nmonitoring both small and large scale civil engineering projects. On the technical side am able to accurately prepare \r\n\r\nprojects to the highest standards, particularly drawings, plans, schedules and constructions design maintenance \r\n\r\ndocumentation production. In the past I has had successful input into the acquisitions of new business, the \r\n\r\npromotions of the company, team leadership, expert technical advice and strategic input into business planning, Am \r\n\r\nlooking for a suitable position with an ambitious &forward thinking company.\r\n\r\nProfessional Summary: \r\n\r\n     (i) NBTC Group (Naser M Al Baddh and Partner General Trading and Contracting.\r\n\r\nCivil Engineer\r\n\r\nDecember 2016 – Present.\r\n\r\nName of the Projects                                : Constructions MGT (Manifold Group Trunk Line) in KOC at Kuwait.\r\n\r\nNature of the Project \r\n\r\n    : Oil and Gas.\r\n\r\nValue of Project         \r\n\r\n    :  36 Million Kuwait Dinar.\r\n\r\n     (ii) MILES Engineering and Construction Solutions LLC. \r\n\r\nCivil Engineer\r\n\r\n  \r\n\r\nOctober-2014 to December-2016 \r\n\r\nName of the Project  \r\n\r\n    : Rabeb Harweel Integrated Project, Oman.\r\n\r\nNature of Project   \r\n\r\n    :  Oil and Gas.\r\n\r\nValue of Project         \r\n\r\n    : 26 Million Oman Riyal.\r\n\r\n     \r\n\r\n\f (iii) TERN Engineering Construction Services Pvt Ltd.\r\n\r\nCivil Engineer\r\n\r\nProject - 1\r\n\r\n  \r\n\r\nApril 2012 to October-2014 \r\n\r\nName of the Project  \r\n\r\n: ANANYA RAINTREE APPARTMENT at COIMBATORE. Tamilnadu, India.\r\n\r\nNature of Project   \r\n\r\n:  Construction of Commercial and Residential Apartments,\r\n\r\nValue of Project         \r\n\r\n: 96 Crores Indian Rupees.\r\n\r\n(iv) MEENA Constructions Pvt Ltd.\r\n\r\nCivil Supervisor\r\n\r\n  \r\n\r\nProject – 1\r\n\r\nJanuary 2010 to January 2012 \r\n\r\nName of the Project  \r\n\r\n    : Peaceful Living at Trichy. Tamilnadu, India.\r\n\r\nNature of Project   \r\n\r\n    : Construction of Commercial and Residential Villas and Complex,\r\n\r\nValue of Project         \r\n\r\n    : 7.50 Crores Indian Rupees.\r\n\r\nArea of Exposure:\r\n\r\n Planning with Use of MSP (Micro Soft Project). \r\n\r\n Site Executions and Management work.\r\n\r\n Quality checking All Civil and MEP also HVAC Works\r\n\r\n Quantity Surveyor All Civil and MEP also HVAC Works.\r\n\r\n Drafting with use of Auto cad, Revert, Sketch Pro. \r\n\r\n PTW (Permit to Work) Issuing and Taking.\r\n\r\nNature of Job Responsibilities:\r\n\r\n Budget Framing and rate analysis to all work (Civil, Electricals, Mechanical, HVAC, and Plumbing).\r\n\r\n Preparing MSP (Master Schedule Program) with use of MS-Projects.\r\n\r\n Contractor Finalize for all works (Civil, Electricals, Mechanical, HVAC, and Plumbing).\r\n\r\n Site management and monitoring for all civil work.\r\n\r\n Preparing and documentation of RFI, SI, CL, DPR, DLR, Weekly Report, Monthly Report.\r\n\r\n Working with clients, contractors, architects, local authorities and external agencies on various renovation and new \r\n\r\nbuild projects.\r\n\r\n Creating 2D and 3D drawings and designs using AutoCAD and Reveet amongst other design packages.\r\n\r\n Designing concrete structural elements, e.g. foundation, beams and walls.\r\n\r\n Providing technical assistance to members of a multi-disciplined design team.\r\n\r\n Performing assessments on the structural integrity of buildings.\r\n\r\n Performing general construction duties on sites.\r\n\r\n Working towards strict deadlines, often under continues pressure.\r\n\r\n Overseeing construction works being completed on site.\r\n\r\n Establishing a project brief and budget proposals before the start of a project.\r\n\r\n Assessing the potential risks of projects.\r\n\r\n Attending regular multi-disciplined meetings to discuss projects.\r\n\r\n Regularly checking progress of works according to the schedule.\r\n\r\n Managing budgets and other project resources.\r\n\r\n\f Maintaining safety on site through promoting a safety culture.\r\n\r\n Executions of all Civil Work (Structural and Finishing) in the Manifold Building, Manifold Platform, Manifold Skid \r\n\r\nShelter, HVE, Diesel , HPU, Chemical, Foam monitor Shelters work and Pig Launcher and Receiver, Flow Line, Tie In\r\n\r\nPoint, Residual collections vessel work at GC30MMF, GC30-SGrMF-02, GC31MF, GC31-SGrMF-04, \r\n\r\n Pre engineering building foundations, wall, grade slab, painting, structural work, sheet cladding work. \r\n\r\n Pre engineering building internal finishing work with false ceiling.\r\n\r\n Pre engineering building internal panel supports fixing, tray support fixing work.\r\n\r\n Manifold Platform, Manifold Skid Shelter foundations installations, grade slab casting work, steel structure erections, \r\n\r\n HVE, Diesel, HPU, Chemical, Foam monitor Shelters foundations, grade slab and sump pit work also finishing \r\n\r\n Pig Launcher and Receiver, pig inlet pipe supports, Flow Line pipe supports, Tie In Point foundations installations and \r\n\r\ngrating installations.\r\n\r\n(Painting) work.\r\n\r\nfinishing work.\r\n\r\n Residual collections vessel pit Mass excavations, raft, wall rebar, form and concrete work, Valve pit finishing work.\r\n\r\n Manual valve pit, fire valve pit, drain line valve pit, CC/CP valve pit casting and finishing work.\r\n\r\n Electrical, Instrument, Telecom cable trench work.\r\n\r\n EIT, HSE foundations installations for monitoring and controlling purpose.\r\n\r\n Site, Labor and Materials also Machinery Management.\r\n\r\n Supervising junior staff, contractors and subcontractors.\r\n\r\n Co-ordinate with the other Contractor like Mechanical, Electrical and Instrument also Telecom Contractor and give the \r\n\r\nwork front to the other contractor.\r\n\r\n Prepare the monthly, weekly and daily schedule and revenue report.\r\n\r\n Prepare the schedule before and after complete the punch list for client walk down to close the ITR.\r\n\r\n Prepare and submitting the RFI, ITR for closing the RFI and ITR. \r\n\r\n Monitor the Progress and Report to the Constructions and Project Manager. \r\n\r\n(ii) Designing, Planning (Auto Cad, Revert, MSP (Micro Soft Project).\r\n\r\n2010 to 2011.\r\n\r\n2008 to 2012.\r\n\r\nTamilnadu, India.\r\n\r\nTrichy, Tamilnadu.\r\n\r\nTrichy, Tamilnadu. \r\n\r\n Communication with Client and Consultants\r\n\r\nEDUCATION INFORMATIONS.\r\n\r\n(i) Bachelor of Civil Engineering and Technology\r\n\r\n MIET Engineering and Technology\r\n\r\n CADD Center\r\n\r\n Syss Way Center\r\n\r\nCOMPETENCIES         \r\n\r\n Good communication and presentation skills.   \r\n\r\n Organized and well-structured at work  \r\n\r\n Committed to deliver write in time as per schedules.\r\n\r\n Good Management to the Site and Office as a Teem Works.\r\n\r\n\fHSE - Health, Safety, and Environment.\r\n\r\n Suggest proactive measurements that prevent incidents before they manifest as accidents.\r\n\r\n Coordinate all health and safety aspects of your construction project.\r\n\r\n Draft health and safety plans and verify any existing or proposed plans.\r\n\r\n Comply with all relevant HSE construction regulations and requirements.\r\n\r\n Ensure the health and safety of workers, decrease accident risks and improve onsite productivity.\r\n\r\n Gain expert advice and recommendations for future safety maintenance and create a long-term safety culture. \r\n\r\n Suggest proactive measurements that prevent incidents before they manifest as accidents.\r\n\r\nAwards Winnings:\r\n\r\n Best Concepts of the Project (Green Building Concepts).\r\n\r\n First Prizes in Inter College Cricket Tournament.\r\n\r\n NCC (National Cadet Caps) Grade ‘B’ \r\n\r\n Third prize in Environment Quiz Contest in Kuwait.\r\n\r\n Third Prize in Environment Essay Contest in Kuwait.\r\n\r\n Best Engineer in the Project Awards from Client (Amec &Wood Group) in Kuwait.\r\n\r\nPersonal Details.\r\n\r\n Date of Birth\r\n\r\n Age\r\n\r\n Sex               \r\n\r\n \r\n\r\n Father’s Name     \r\n\r\n Mother Name      \r\n\r\n Marital Status    \r\n\r\n Nationality \r\n\r\n Passport No      \r\n\r\n Passport ED     \r\n\r\nDECLARATION.\r\n\r\n: \r\n\r\n: \r\n\r\n: \r\n\r\n:\r\n\r\n:\r\n\r\n: \r\n\r\n: \r\n\r\n: \r\n\r\n: \r\n\r\n30-Jun-1991\r\n\r\n28\r\n\r\nMale\r\n\r\n K.Moorthy\r\n\r\n M.Pottu\r\n\r\nSingle\r\n\r\nIndian\r\n\r\nL2951223\r\n\r\n31-Jul-2023\r\n\r\nI wish that your guidance is the literal place for my aspiring career. I hereby declare that\r\n\r\nthe above-mentioned information is correct up to my knowledge and I bear the responsibility for\r\n\r\nthe correctness of the above-mentioned particulars.\r\n\r\nSignature.\r\n\r\n(Selvam Moorthy).\r\n\r\n\f",{"entities":[[0,14,"PERSON"],[37,42,"LOCATION"],[65,85,"EMAIL"],[89,104,"CONTACT"],[1899,1909,"ORGANISATION"],[1976,1990,"ROLE"],[1994,2018,"DURATION"],[2076,2093,"PROJECTS"],[2265,2314,"ORGANISATION"],[2343,2372,"DURATION"],[2408,2440,"PROJECTS"],[2576,2623,"ORGANISATION"],[2666,2692,"DURATION"],[2724,2750,"PROJECTS"],[2754,2765,"LOCATION"],[2766,2775,"LOCATION"],[2936,2964,"ORGANISATION"],[2968,2984,"ROLE"],[3009,3037,"DURATION"],[3073,3099,"PROJECTS"],[3100,3109,"LOCATION"],[3111,3117,"LOCATION"],[7154,7162,"SKILLS"],[7201,7214,"DURATION"],[7218,7231,"DURATION"],[7379,7423,"EDUCATION"],[7429,7460,"INSTITUTION"],[7466,7477,"INSTITUTION"],[7483,7498,"INSTITUTION"],[9106,9115,"PERSON"],[9120,9127,"PERSON"],[9443,9457,"PERSON"]]}]]}