{"classes":["PERSON","LOCATION","SKILLS","CONTACT","EMAIL","ROLE","ORGANISATION","DURATION","CERTIFICATE","PROJECTS","EDUCATION","INSTITUTION"],"annotations":[["Jeffrey Fermin\nGrowth Marketer with 12 years Experience Getting Enterprise Tech Companies to\nProfitability\nSouth Miami, FL\n-Email me on Indeed: http://www.indeed.com/r/Jeffrey-Fermin/60585b76ad4f59ec\n\nAn experienced marketer whose professional journey started with founding Officevibe, a business-to-\nbusiness software used by over 4,000 organizations in over 100 countries. With 12 years of growth\nmarketing experience for enterprise tech companies, I’m familiar with implementing nuanced,\nomnichannel strategies that broaden reach, improve acquisition, and drive sales. I am passionate\nabout digital marketing as a whole and am consistently broadening and refining my skill set.\n\nWilling to relocate to: Tampa, FL - Remote -\nAuthorized to work in the US for any employer\n\nWork Experience\n\nCo-Founder and Marketing Manager\nNew Theory Creative - Miami, FL\nJune 2019 to Present\n\nFounded  a  creative-centric  growth  agency  where  I  built  a  six-person  team  that  managed  various\ncampaigns for over 20 clients. Established and implemented SOPs for projects related to SEO, content\nmarketing, and ad campaigns for major platforms. Led video and photo production projects in conjunction\nwith other agencies and freelance talent.\n\nHead of Marketing and Sales\nButterfly Artificial Intelligence - New York, NY\nJanuary 2018 to January 2019\n\nWorked  cross-functionally  with  sales  and  product  teams  to  implement  an  account-based  marketing\nstrategy geared towards Fortune 500 companies; allowing us to acquire high-profile large and midsize\nenterprises as paying clients.\n• Played an integral role in the company’s 85% revenue growth\n• Managed PR efforts, getting the company featured on several media outlets including CNBC, WSJ, and\nFox Business.\n• Directed a panel at \"Social Media Week\" working in collaboration with Wal-Mart to discuss software's\nrole in the future of work.\n\nDigital Marketing Contractor\nClubhouse Software - New York, NY\nJanuary 2017 to December 2017\n\nThis was a one-year-contract role with Clubhouse (now Shortcut) that focused on quickly raising brand\nawareness and lead generation efforts between the company’s seed round and Series A — they went on to\nobtain $10 Mil late 2018. As the company's first-ever marketing hire, my role consisted of me having to:\n•  Manage  conception,  development,  and  implementation  of  marketing  plan  and  strategies,  product\nconcepts, and promotional programs to drive interest and sales\n• Optimized landing pages and improved CRO, leading to an improvement in the\n\n\faverage monthly sign-ups by 112%.\n• Created user profiles, case studies, along with customer-relevant content, that\nimproved the average monthly website traffic by 30% every month.\n• Spearhead the strategic and tactical execution of marketing campaigns, including design of test/control\nsegmentation, implementation of tests, tracking, results reporting, analysis, and recommendations.\n\nDigital Marketing Contractor\nFuturestay - Newark, NJ\nJanuary 2016 to February 2017\n\nThis was a one-year contract with Futurestay, a startup in the hospitality space. My duties in this role\nincluded:\n\n• Establish positioning, identify target audiences, and develop marketing plans with specific objectives\nacross different channels and segments.\n• Lead the execution of marketing programs from start to finish, leveraging internal support and driving\ncollaboration\n• Analyze customer insights, consumer trends, market analysis, and marketing best practices to build\nsuccessful strategies\n• Create, maintain, and conduct analytics reporting across multiple platforms and extract key insights\nfor  future  campaign  development  and  go-to-market  strategies,  complete  with  formal  proposals  and\nrecommendations on tactics.\n• Partner with email, performance marketing and web teams to design, test and evolve lead nurturing\ntactics.\n\nMilestones:\n• Directly responsible for improving the user base from 8,000 to 75,000 users\n• Collaborated with designers and senior management to lead a rebrand.\n• Supported ‘Client Success’ by implementing a CRM. Along with crafting all\nmessaging and collateral to acquire and retain leads.\n\nCo-Founder and Marketing Director\nOfficevibe - Boston, MA\nSeptember 2011 to October 2015\n\nStarted Officevibe. A pulse survey tool used by over 4,000 organizations in 100 countries. I spearheaded\nthe marketing and sales departments; establishing an omnichannel marketing strategy that allowed the\ncompany to gain traction and expand globally. Officevibe was acquired by Montreal-based Gsoft in 2013.\n• Over $7 Mil in Annual Recurring Revenue in less than 4 years.\n• Established and refined SOPs for marketing, sales, and customer success, allowing us to consistently\nimprove conversion rates at every part of the funnel.\n• Hired over 40 employees, managed global contractors, and creative agencies.\n• Established strategic tech partnerships that added new leads to the pipeline. Specifically, Microsoft,\nSlack, Zenefits, and Bamboo HR.\n• Used an SEO-centric content strategy that led to 405k site visits (on average) per month.\n• Obtained over 100k social media followers and 80k newsletter subscribers.\n\n\fEducation\n\nBachelor's in Psychology\nFlorida International University - Miami, FL\nMay 2009 to April 2011\n\nSkills\n\n• PPC Campaign Management (3 years)\n\n• Digital Marketing (10+ years)\n\n• Search Engine Optimization (SEO) (8 years)\n\n• SEM (3 years)\n\n• Google Analytics (8 years)\n\n• Analytics (6 years)\n\n• B2B Sales (4 years)\n\n• Performance Marketing (8 years)\n\n• E-Commerce (2 years)\n\n• Blogging (10+ years)\n\n• Google AdWords (2 years)\n\nLanguages\n\n• Spanish - Intermediate\n• English - Expert\n\nLinks\n\nhttp://twitter.com/jefffermin\n\nhttps://jeffreyfermin.medium.com/\n\nhttps://www.linkedin.com/in/jfermin\n\nhttps://www.newtheory.miami\n\nAwards\n\nWhite House Billion+ Change Panelist\nJanuary 2012\n\nTechnology Advice HR Tech Leader to Follow\nJanuary 2013\n\nBuiltinMTL Top Entrepreneur List\n\n\fMarch 2013\n\nMicrosoft Octas Innovation Award\n2014\n\nMicrosoft Octas Innovation Award\n2015\n\nTechCrunch Disrupt (Runner-Up)\n2014\n\nVoyage MIA Entrepreneur Spotlight\n2020\n\nShoutout Miami Entrepreneur Spotlight\n2021\n\nCertifications and Licenses\n\nInbound Marketing Certification\nPresent\n\nAssessments\n\nSocial media — Proficient\nAugust 2021\n\nKnowledge of popular social media platforms, features, and functions\nFull results: Proficient\n\nMarketing — Proficient\nDecember 2021\n\nUnderstanding a target audience and how to best communicate with them\nFull results: Proficient\n\nSearch engine optimization — Expert\nJanuary 2022\n\nInterpreting online website performance metrics and understanding search engine optimization tactics\nFull results: Expert\n\nSearch engine optimization — Expert\nJanuary 2022\n\nInterpreting online website performance metrics and understanding search engine optimization tactics\nFull results: Expert\n\nIndeed Assessments provides skills tests that are not indicative of a license or certification, or continued\ndevelopment in any professional field.\n\n\f",{"entities":[[0,14,"PERSON"],[15,30,"ROLE"],[36,44,"DURATION"],[113,118,"LOCATION"],[120,122,"LOCATION"],[380,388,"DURATION"],[791,801,"ROLE"],[806,823,"ROLE"],[824,843,"ORGANISATION"],[846,851,"LOCATION"],[853,855,"LOCATION"],[856,876,"DURATION"],[1233,1260,"ROLE"],[1261,1294,"ORGANISATION"],[1297,1305,"LOCATION"],[1310,1338,"DURATION"],[1887,1915,"ROLE"],[1916,1934,"ORGANISATION"],[1937,1945,"LOCATION"],[1947,1949,"LOCATION"],[1950,1979,"DURATION"],[2925,2953,"ROLE"],[2954,2973,"ORGANISATION"],[2975,2977,"LOCATION"],[2978,3007,"DURATION"],[4152,4162,"ROLE"],[4167,4185,"ROLE"],[4186,4196,"ORGANISATION"],[4199,4205,"LOCATION"],[4207,4209,"LOCATION"],[4210,4240,"DURATION"],[5168,5192,"EDUCATION"],[5193,5225,"INSTITUTION"],[5228,5233,"LOCATION"],[5235,5237,"LOCATION"],[5238,5260,"DURATION"],[5272,5295,"SKILLS"],[5297,5304,"DURATION"],[5309,5326,"SKILLS"],[5328,5337,"DURATION"],[5342,5368,"SKILLS"],[5370,5373,"SKILLS"],[5376,5383,"DURATION"],[5388,5391,"SKILLS"],[5393,5400,"DURATION"],[5405,5421,"SKILLS"],[5423,5430,"DURATION"],[5435,5444,"SKILLS"],[5446,5453,"DURATION"],[5458,5467,"SKILLS"],[5469,5476,"DURATION"],[5481,5502,"SKILLS"],[5504,5511,"DURATION"],[5516,5526,"SKILLS"],[5528,5535,"DURATION"],[5540,5548,"SKILLS"],[5550,5559,"DURATION"],[5564,5578,"SKILLS"],[5580,5587,"DURATION"],[6176,6207,"CERTIFICATE"]]}]]}